Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыставленныеАкты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ФормированиеДокументовНаСервере(Знач Период) Экспорт

	ВыборкаДоговоров = ВыбратьДействующиеВПериодеДоговора(Период);

	СписокОтработанныхДоговоров = Новый Массив;

	Если ВыборкаДоговоров.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не отобраны договора по абонентскому обслуживанию для формирования");
		Возврат Неопределено;
	КонецЕсли;
	
	Пока ВыборкаДоговоров.Следующий() Цикл
	
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДатаДокумента = Мин(ОбщегоНазначения.ТекущаяДатаПользователя(), КонецМесяца(КонецДня(Период)));
		ДатаДокумента = Макс(ДатаДокумента,НачалоМесяца(НачалоДня(Период)));
		НовыйДокумент.Дата = ДатаДокумента;

		СсылкаНового = Документы.РеализацияТоваровУслуг.ПолучитьСсылку();
		НовыйДокумент.УстановитьСсылкуНового(СсылкаНового);
		
		НовыйДокумент.Заполнить(СсылкаНового);
		
		ЗаполнитьЗначенияСвойств(НовыйДокумент, ВыборкаДоговоров);
		
		ВыполненоАвтозаполнение = НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение(ВыборкаДоговоров.СуммаАбонентскойПлаты);
		
		Если ВыполненоАвтозаполнение Тогда
			
			НовыйДокумент.СуммаДокумента = НовыйДокумент.Услуги.Итог("Сумма");
			
			Если НовыйДокумент.ПроверитьЗаполнение() Тогда
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				
				СтрокаТаблицы = Новый Структура();
				СтрокаТаблицы.Вставить("Договор", ВыборкаДоговоров.Договор);
				СтрокаТаблицы.Вставить("Документ", НовыйДокумент.Ссылка);
				
				СписокОтработанныхДоговоров.Добавить(СтрокаТаблицы);
					
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат СписокОтработанныхДоговоров;

КонецФункции

Функция ВыбратьДействующиеВПериодеДоговора(Знач Период) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК
		|		ДокументРеализация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
		|		И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &КонецПериода
		|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &НачалоПериода
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
		|	И РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоМесяца(Период)));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецМесяца(Период)));
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
